[
  {
    "name": "Cindy Westra",
    "title": "Sr. Demand Gen Manager",
    "blurb": [
      "Cindy has 12 years of experience driving leads for B2B companies, both in-house and at agencies. She has managed paid media for brands like AT&T Cybersecurity, Insights Learning & Development, and Wiley, optimizing campaigns across Google, Bing, LinkedIn, Meta, and Reddit.",
      "Outside of work, Cindy is a mom to three little ones and has two lazy labs. She runs on ice-cold energy drinks, a good heated blanket, and a passion for sloths."
    ]
  },
  {
    "name": "Jacob Cullum",
    "title": "Sr. Demand Gen Manager",
    "blurb": "Jacob has been scaling marketing programs for over 7 years on both the agency side and in-house. As a Senior Demand Gen Manager, he acts like a member of his clients' marketing teams and will go above and beyond to get the results that they are looking for. Jacob has spent millions of dollars of ad spend across Google, LinkedIn, and Meta on paid ad programs that have led to 50%+ increases in ARR and over $100M raised in private equity. When he's not writing creative briefs for a new split test or running strategy sessions with his clients, Jacob enjoys spending time in the sun in Tampa, Florida where he lives with his wife Caitlin and their dog, a mini schnauzer named Reggie."
  },
  {
    "name": "Walter Silveira",
    "title": "Sr. Demand Gen Manager",
    "blurb": [
      "Walter Silveira is a Sr. Demand Gen Manager with 3 successful exits and over 13 years of experience launching & scaling B2B SaaS and Technology companies from their Go-To-Market stage to their Series C and beyond!",
      "Walter specializes in Inbound channels that connect directly with a bespoke, technical ICP - meeting key decision makers exactly when their buying triggers are strongest, by connecting with them just as they're looking to solve their core business problems.",
      "Walter's work drove over $8M in attributable recurring revenue for his startup & SMB clients in 2024.",
      "When not geeking out about maximizing market share or investing in early stage companies, you can find him running the forest trails of Colorado, lifting at the gym, and volunteering with the Leeds School of Business @ UC Boulder!"
    ]
  }
]